Autodesk.Revit.UI.ElemAttribDialogUtil.ShowBuildingTypesDialog(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Shows the Building Types Dialog
doc:
The document of the Building Types Dialog.
idTypeElem:
What shouod be selected when the dialog opens.
Returns:
Selected id of building type, invalidId if none is selected.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.UI.ElemAttribDialogUtil.ShowReportsFolderDialog(Autodesk.Revit.DB.Document,System.String)
Shows the Reports Folder Dialog.
doc:
The document.
currentStr:
The current (unparsed) path string.
Returns:
The picked (unparsed) path string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.UI.ElemAttribDialogUtil.ShowShematicTypesDialog(Autodesk.Revit.DB.Document)
Shows the Shematic Types Dialog
doc:
The document of the Shematic Types Dialog.
Returns:
True if the input string is valid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.UI.ElemAttribDialogUtil.ShowConcetualTypesDialog(Autodesk.Revit.DB.Document)
Shows the Concetual Types Dialog
doc:
The document of energy data settings to be displayed.
Returns:
True if the input string is valid
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022